{
  "basics": {
    "name": "Swathi Dhanasekaran",
    "label": "Graduate Student",
    "picture": "/images/swathi.jpg",
    "email": "dhanasekaran.s@neu.edu",
    "phone": "518-901-8105",
    "website": "https://Caffeinated-Code.github.io",
    "summary": "Graduate student at Northeastern University studying Bioinformatics, seeking full-time Computational Biologist, Bioinformatics Engineer/Scientist in a fast-paced work environment ",
    "location": {
      "address": "",
      "postalCode": "02151",
      "city": "Revere",
      "countryCode": "USA",
      "region": "Massachusetts"
    },
    "profiles": [
      {
        "network": "github",
        "username": "Caffeinated-Code",
        "url": "http://github.com/Caffeinated-Code"
      },
      {
        "network": "linkedin",
        "username": "swathidhanasekaran",
        "url": "https://www.linkedin.com/in/swathidhanasekaran/"
      },
      {
        "network": "instagram",
        "username": "caffeinated_code",
        "url": "https://www.instagram.com/caffeinated_code/"
      }
    ]
  },
  "interests": [
    {
      "name": "NGS Workflows",
      "keywords": [
      ]
    },
    {
      "name": "Single Cell Genomics",
      "keywords": [
      ]
    },
    {
      "name": "Circadian Rhythms",
      "keywords": [
      ]
    },
    {
      "name": "Precision Medicine",
      "keywords": [
      ]
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "level": "",
      "keywords": [
        "Python",
        "R",
        "Perl",
        "Shell Scripting",
        "SQL",
        "MATLAB"
      ]
    },
     {
      "name": "Omics Data Analysis",
      "level": "",
      "keywords": [
        "Raw genomic data pre-processing",
        "Nascent transcription analysis",
        "Transcription Factor binding prediction",
        "Single cell analysis",
        "Nanopore data analysis",
        "RNA-seq analysis",
        "Gene Set Enrichment Analysis",
        "KEGG pathway analysis",
        "Network Visualization and analysis"
      ]
    },
    {
      "name": "Frameworks/Libraries",
      "level": "",
      "keywords": [
        "Bioconductor",
        "dplyr",
        "ggplot2",
        "seurat",
        "maftools",
        "DEseq2",
        "pathfindR",
        "BioPython",
        "Pandas",
        "numpy",
        "seaborn",
        "matplotlib",
        "Bioperl",
        "phylogram",
        "TCGAWorkflow"
      ]
    },
    {
      "name": "Bioinformatics tools",
      "level": "",
      "keywords": [
        "proseq2",
        "slamdunk",
        "seurat",
        "FASTX_Toolkit",
        "MultiQC",
        "UMI-Tools",
        "SAMtools",
        "bedtools"
        "dREG",
        "HOMER"
        "BWA",
        "IGV",
        "IPA"
      ]
    },
    {
      "name": "Development tools",
      "level": "",
      "keywords": [
        "Git",
        "AWS",
        "Dockers"
      ]
    }
  ],
  "education": [
    {
      "institution": "Northeastern University, Boston, MA",
      "area": "Bioinformatics",
      "studyType": "M.S.",
      "startDate": "Fall 2018",
      "endDate": "Expected Spring, 2020",
      "courses": [
        "Statistical Programming in R, Bioinformatics Computational Methods, Advanced Genomics, Network Science, Machine Learning"
      ]
      "highlights": [
          "Proposed and led my team mates in building a pilot-scale database catologing different phytochemicals, their biological activities, medicinal uses, traditional knowledge, and relevant literature by combining reductionist approaches of modern medicine and holistic approaches of Ayurveda. The database has ~122k Phytochemical-Activity interactions and can serve as a repository of lead suspects that could be taken up for Phase-0 clinical trials.",
          "Constructed a dynamic Artists-Dealers-Collectors multimodal network with mined provenance data depicting sidelining of female artists in art history as a part of a Network analysis course."
      ]
    }
  ],
  "work": [
    {
      "company": "Computational Methods-2",
      "position": "Graduate Lab Assistant Volunteer",
      "website": "",
      "startDate": "January 2020",
      "endDate": "Present",
      "summary": "Northeastern University, Boston, MA",
      "highlights": [
        "Assist in supervising lab sessions for graduate students and mentor students on individual basis.",
      ]
    },
    {
      "company": "CAMP4 Therapeutics",
      "position": "Bioinformatics/Data Science Co-op",
      "website": "",
      "startDate": "September 2019",
      "endDate": "December 2019",
      "summary": "Cambridge, MA",
      "highlights": [
        "Maintained a dockerized pipeline on AWS capable of multi-containerizing high volumes of SLAMseq data for faster processing. The metabolic RNA labelling data was analyzed to base-pair level resolution to generate nucleotide conversion counts by delineating it from true SNPs. This helped understand transcriptome-wide RNA synthesis and turnover in a temporal manner.",
        "Exploratory data analysis of nascent transcription data from PROseq for detecting enhancer-mediated gene regulation using proseq2 pipeline.",
        "Built a bash/awk pipeline to automate and streamline processing of large sample sets. The script also generates compiled data quality reports on read statistics and adapter contamination, which was helpful to understand data quality issues and design an analysis plan accordingly.",
        "Finetuned the proseq2 workflow with custom modules that filter rRNA, tRNA, mtDNA, microRNA, and spike-ins, quantify gene body and promoters, perform comparative analysis, GSEA, pathway analysis and generate visualizations to suit in-house research requirements.",
        "Peak calling with dREG and motif discovery with HOMER and MDS to support result congruence. Simultaneously generated UCSC tracks to effectively communicate genome wide effect of drug.",
        "Tested and documented the workflow using data from donor liver cells treated with drugs having known MOA as well as public GEO datasets. Presented the workflow and demonstrated its ability to capture nascent transcription at known targets in a company-wide meeting."
      ]
    },
    {
      "company": "Khrapko Lab",
      "position": "Lab Volunteer",
      "startDate": "April 2019",
      "endDate": "May 2019",
      "summary": "Northeastern University, Boston, MA",
      "highlights": [
        "Compared different alignment tools to identify the best suited aligner, and developed a custom UMI processing module for long read data from mitochondria in mice ova (ONT MinION). This assisted a Ph.D. student with her research to understand purifying selection in the context of Aging.",
        ]
    },
    {
      "company": "Cactus Communications",
      "position": "Freelance Scientific Editor",
      "website": "",
      "startDate": "April 2017",
      "endDate": "August 2018",
      "summary": "Mumbai, India",
      "highlights": [
        "Assisted researchers with manuscript preparation, including fact checking, citation management, and scientific editing for publication in high impact factor journals. Consistently placed among top editors of the month based on client ratings and turnaround volume.",
      ]
    },
  ],
  "volunteer": [
    {
      "organization": "Northeastern University",
      "website": "",
      "position": "Indian Ayurvedic Bioflavonoids Database",
      "startDate": "January 2019",
      "endDate": "March 2019",
      "summary": "",
      "highlights": [
      "Proposed and led my team mates in building a pilot-scale database catologing different phytochemicals, their biological activities, medicinal uses, traditional knowledge, and relevant literature by combining reductionist approaches of modern medicine and holistic approaches of Ayurveda.",
      "The database has ~122k Phytochemical-Activity interactions and can serve as a repository of lead suspects that could be taken up for Phase-0 clinical trials.",
      ]
    }
    {
      "organization": "Chronobiology Lab",
      "website": "",
      "position": "Graduate Researcher",
      "startDate": "January 2016",
      "endDate": "April 2017",
      "summary": "JNCASR, Bengaluru, India",
      "highlights": [
        "Found evidence for tight coupling of certain circadian rhythms in Drosophila populations selected for phase of eclosion using time series analysis and circular statistics. This helped in understanding the evolution of phase divergence among the populations.",
        "Hands on experience with Trizol RNA extraction from Drosphila brains to study the temporal expression profiles of core clock genes."
        "Genotype-Phenotype association studies on DGRC Drosophila Deletion lines, Kyoto indicated that genes involved in development and core clock regulation affect gating of eclosion."
      ]
    },
  ],
  
  "references": [
    {
      "name": "Available upon request",
      "reference": ""
    }
  ]
}
